alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F065_standard_mult_mem_0.c
/* ###################
 * START OF NEW MEMPAGE: 0 */
/* Register 0                                                                       */
/* out_xy_comp 16                                                                   */
/* input0_select 16                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 1                                                                       */
/* out_xy_comp 17                                                                   */
/* input0_select 17                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 2                                                                       */
/* out_xy_comp 18                                                                   */
/* input0_select 18                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 3                                                                       */
/* out_xy_comp 19                                                                   */
/* input0_select 19                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 4                                                                       */
/* out_xy_comp 20                                                                   */
/* input0_select 20                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 5                                                                       */
/* out_xy_comp 21                                                                   */
/* input0_select 21                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 6                                                                       */
/* out_xy_comp 22                                                                   */
/* input0_select 22                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 7                                                                       */
/* out_xy_comp 23                                                                   */
/* input0_select 23                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 8                                                                       */
/* out_xy_comp 24                                                                   */
/* input0_select 24                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 9                                                                       */
/* out_xy_comp 25                                                                   */
/* input0_select 25                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 10                                                                      */
/* out_xy_comp 26                                                                   */
/* input0_select 26                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 11                                                                      */
/* out_xy_comp 27                                                                   */
/* input0_select 27                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 12                                                                      */
/* out_xy_comp 28                                                                   */
/* input0_select 28                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 13                                                                      */
/* out_xy_comp 29                                                                   */
/* input0_select 29                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 14                                                                      */
/* out_xy_comp 30                                                                   */
/* input0_select 30                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/* Register 15                                                                      */
/* out_xy_comp 31                                                                   */
/* input0_select 31                                                                 */
/* mult_op 0                                                                        */
/* Multiplier0                                                                      */
/* mult0_in0 0                                                                      */
/* mult0_in1 1                                                                      */
/* out_x_select 2                                                                   */
/* Multiplier1                                                                      */
/* mult1_in0 2                                                                      */
/* mult1_in1 3                                                                      */
/* out_y_select 3                                                                   */
/*  load multiple registers (0-63) from address 0x40                                */
/*  load constant registers (0-3) from address 0x300                                */
/*  load shader from address 0x400                                                  */
/*  set number of output registers                                                  */
/*  Set a single configuration register                                             */
/*  Start shader                                                                    */
/* unsigned int data_00000000[1024] = */ 
{
  0x00000040, 0x20400000, 0x00000300, 0x30040000 /* 0x0; */
, 0x00000400, 0x40100000, 0x0f000f33, 0x10000042 /* 0x10; */
, 0x00f03c00, 0x10000040, 0x01000001, 0x00000000 /* 0x20; */
, 0x00000000, 0x60000000, 0x00000000, 0x00000000 /* 0x30; */
, 0x00000200, 0x00100003, 0x00000210, 0x00100003 /* 0x40; */
, 0x00000220, 0x00100003, 0x00000230, 0x00100003 /* 0x50; */
, 0x00000240, 0x00100003, 0x00000250, 0x00100003 /* 0x60; */
, 0x00000260, 0x00100003, 0x00000270, 0x00100003 /* 0x70; */
, 0x00000280, 0x00100003, 0x00000290, 0x00100003 /* 0x80; */
, 0x000002a0, 0x00100003, 0x000002b0, 0x00100003 /* 0x90; */
, 0x000002c0, 0x00100003, 0x000002d0, 0x00100003 /* 0xa0; */
, 0x000002e0, 0x00100003, 0x000002f0, 0x00100003 /* 0xb0; */
, 0x00002000, 0x00100001, 0x00002008, 0x00100001 /* 0xc0; */
, 0x00002010, 0x00010001, 0x00002018, 0x00010001 /* 0xd0; */
, 0x00002020, 0x00010001, 0x00002028, 0x00010001 /* 0xe0; */
, 0x00002030, 0x00010001, 0x00002038, 0x00010001 /* 0xf0; */
, 0x00002040, 0x00010001, 0x00002048, 0x00010001 /* 0x100; */
, 0x00002050, 0x00010001, 0x00002058, 0x00010001 /* 0x110; */
, 0x00002060, 0x00010001, 0x00002068, 0x00010001 /* 0x120; */
, 0x00002070, 0x00010001, 0x00002078, 0x00010001 /* 0x130; */
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x00000000, 0x3f800000, 0x4de1a300, 0x4de1a300 /* 0x200; */
, 0x500be400, 0x3f800000, 0x500be400, 0x40000000 /* 0x210; */
, 0xcf6b2800, 0x3f800000, 0xd00be400, 0x40000000 /* 0x220; */
, 0x00000000, 0x3f800000, 0x3f800000, 0x00000000 /* 0x230; */
, 0x80000000, 0x3f800000, 0x3f800000, 0x80000000 /* 0x240; */
, 0x7fffffff, 0x41a80000, 0x41b00000, 0x7f800000 /* 0x250; */
, 0x3f800000, 0xff800000, 0x3f800000, 0x7fffffff /* 0x260; */
, 0xff800000, 0xff800000, 0x3f800000, 0x7fffffff /* 0x270; */
, 0x7f800000, 0x00000000, 0x00000000, 0x7f800000 /* 0x280; */
, 0x7f800000, 0x7fffffff, 0x7fffffff, 0x7f800000 /* 0x290; */
, 0x7fffffff, 0x7f800000, 0xff800000, 0x7fffffff /* 0x2a0; */
, 0x00000000, 0x80000000, 0x80000000, 0x00000000 /* 0x2b0; */
, 0x00000000, 0x00000000, 0x80000000, 0x80000000 /* 0x2c0; */
, 0xc0800000, 0xc0a00000, 0xc0c00000, 0xc0e00000 /* 0x2d0; */
, 0x7f800000, 0x7f800000, 0xff800000, 0xff800000 /* 0x2e0; */
, 0x41400000, 0xc1500000, 0x7f800000, 0xff800000 /* 0x2f0; */
, 0x3f2a6410, 0xbf3176b4, 0x3e8d8e95, 0x00000000 /* 0x300; */
, 0x3f2f70e6, 0x3f36e245, 0x3e10c5cc, 0x00000000 /* 0x310; */
, 0xbe974e6d, 0x3dc353b6, 0x3f735827, 0x00000000 /* 0x320; */
, 0x00000000, 0x00000000, 0x00000000, 0x3f800000 /* 0x330; */
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0x0, 0x0, 0x0, 0x0
, 0xad418820, 0x400002b5, 0x4007ed00, 0x00001c00 /* 0x400; */
, 0xad418820, 0x440002b5, 0x4407ed00, 0x00001c00 /* 0x410; */
, 0xad418820, 0x480002b5, 0x4807ed00, 0x00001c00 /* 0x420; */
, 0xad418820, 0x4c0002b5, 0x4c07ed00, 0x00001c00 /* 0x430; */
, 0xad418820, 0x500002b5, 0x5007ed00, 0x00001c00 /* 0x440; */
, 0xad418820, 0x540002b5, 0x5407ed00, 0x00001c00 /* 0x450; */
, 0xad418820, 0x580002b5, 0x5807ed00, 0x00001c00 /* 0x460; */
, 0xad418820, 0x5c0002b5, 0x5c07ed00, 0x00001c00 /* 0x470; */
, 0xad418820, 0x600002b5, 0x6007ed00, 0x00001c00 /* 0x480; */
, 0xad418820, 0x640002b5, 0x6407ed00, 0x00001c00 /* 0x490; */
, 0xad418820, 0x680002b5, 0x6807ed00, 0x00001c00 /* 0x4a0; */
, 0xad418820, 0x6c0002b5, 0x6c07ed00, 0x00001c00 /* 0x4b0; */
, 0xad418820, 0x700002b5, 0x7007ed00, 0x00001c00 /* 0x4c0; */
, 0xad418820, 0x740002b5, 0x7407ed00, 0x00001c00 /* 0x4d0; */
, 0xad418820, 0x780002b5, 0x7807ed00, 0x00001c00 /* 0x4e0; */
, 0xad418820, 0x7c0002b5, 0x7c07ed00, 0x00001c00 /* 0x4f0; */
},

/* ###################
 * START OF NEW MEMPAGE: 2 */
/* EMPTY PAGE */ 
/* unsigned int data_00002000[1024]; */ 
{0},

};
